SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/InformationRegisters/рарусШтрихкодыНоменклатуры/рарусШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впПриходТМЦ/впПриходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впПриходТМЦ</name>
  <basedOn>Document.впЗаявкаНаСнабжение</basedOn>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <registerRecords>AccumulationRegister.впТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.впТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.впЗаказПоставщику</types>
      <types>DocumentRef.впПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийПриходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОприходованиеБывшегоВУпотреблении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученВБМ</name>
    <comment>rarus atyutyakin ФТ.ИМ.02.01</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/Номенклатура/ManagerModule.bsl
// + Устарела
Функция ДополнительныеРеквизитыСтрокойУдалить(Источник, Разделитель = Неопределено) Экспорт
	
	Возврат рарусОбщегоНазначенияСервер.ДополнительныеРеквизитыСтрокой(Источник, Разделитель);
	
КонецФункции
//

////////////////////////////////////////////////////////////////////////////////
//
// Функция 
//
// Описание: 
//	Формирует представление дополнительных реквизитов для списка номенклатуры
//
// Параметры:
//   Номенклатура - Массив, СправочникСсылка.Номенклатура - объекты по которым необходимо построить представление.
//
// Возвращаемое значение: Соответствие
//
Функция ДополнительныеРеквизитыСтрокой(Номенклатура) Экспорт
			
	Если ТипЗнч(Номенклатура) <> Тип("Массив") тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Номенклатура);
	Иначе
		МассивОбъектов = Номенклатура;
	КонецЕсли;
	
	Возврат рарусОбщегоНазначенияСервер.ДополнительныеРеквизитыСтрокойПоСпискуОбъектов(МассивОбъектов);
	
КонецФункции

Функция ОписаниеДополнительныхРеквизитовНоменклатуры(Номенклатура) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) тогда
		Возврат "";
	КонецЕсли;
	
	СоотвествтиеНоменклатураСтрока = Справочники.Номенклатура.ДополнительныеРеквизитыСтрокой(Номенклатура);
	
	СтрокаПредставления = СоотвествтиеНоменклатураСтрока[Номенклатура];
	
	Возврат ?(ЗначениеЗаполнено(СтрокаПредставления), СтрокаПредставления, "");

КонецФункции

Функция НепроверяемыеРеквизиты(Объект) Экспорт
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	РеквизитыСПереопределеннойОбязательностьюЗаполнения = РеквизитыСПереопределеннойОбязательностьюЗаполнения(Объект.ТипНоменклатуры, Неопределено, Объект);

	Для Каждого КлючЗначение Из РеквизитыСПереопределеннойОбязательностьюЗаполнения Цикл
		
		Если Не КлючЗначение.Значение Тогда
			МассивНепроверяемыхРеквизитов.Добавить(КлючЗначение.Ключ);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат МассивНепроверяемыхРеквизитов;
	
КонецФункции

Функция РеквизитыСПереопределеннойОбязательностьюЗаполнения(ТипНоменклатуры, ОсобенностьУчета, Объект) Экспорт
	
	РеквизитыСПереопределеннойОбязательностьюЗаполнения = Новый Соответствие;
		
	РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить("Наименование", Истина);
		
	Если Объект = Неопределено Тогда
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить("НаборУпаковок", Ложь);
	Иначе
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить("НаборУпаковок", Объект.ИспользоватьУпаковки);
	КонецЕсли;
	
	РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить("ЕдиницаИзмерения", ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар
																			Или ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара
																			Или ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
																			
	ПереопределитьОбязательностьЗаполненияРеквизитовМеры(Объект, РеквизитыСПереопределеннойОбязательностьюЗаполнения, "Вес");
	ПереопределитьОбязательностьЗаполненияРеквизитовМеры(Объект, РеквизитыСПереопределеннойОбязательностьюЗаполнения, "Объем");
	ПереопределитьОбязательностьЗаполненияРеквизитовМеры(Объект, РеквизитыСПереопределеннойОбязательностьюЗаполнения, "Площадь");
	ПереопределитьОбязательностьЗаполненияРеквизитовМеры(Объект, РеквизитыСПереопределеннойОбязательностьюЗаполнения, "Длина");		
	
	Возврат РеквизитыСПереопределеннойОбязательностьюЗаполнения;
	
КонецФункции

Процедура ПереопределитьОбязательностьЗаполненияРеквизитовМеры(Объект, РеквизитыСПереопределеннойОбязательностьюЗаполнения, Мера)
	
	Если Объект = Неопределено Тогда
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить(Мера + "Числитель", Ложь);	
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить(Мера + "Знаменатель", Ложь);	
	Иначе
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить(Мера + "Числитель", Объект[Мера + "Использовать"]);	
		РеквизитыСПереопределеннойОбязательностьюЗаполнения.Вставить(Мера + "Знаменатель", Объект[Мера + "Использовать"]);	
	КонецЕсли;	
	
КонецПроцедуры

// ++ rarus yukuzi 25.02.2021   // ФТ.СНБ.02. Задача_Штрихкодирование
#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Судно=vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	Если ЗначениеЗаполнено(Судно) тогда
		ПараметрыФО= Новый Структура("Период, Судно", ТекущаяДата(), Судно);
	иначе
		ПараметрыФО= Новый Структура("Период", ТекущаяДата());
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьШтрихкодирование",  ПараметрыФО) Тогда
				
		// Этикетки
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "ЭтикеткиОтдельные";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки';
		|en = 'Labels'");
		
		КомандаПечати = КомандыПечати.Добавить();	
		КомандаПечати.Идентификатор = "ЭтикеткиА4";
		КомандаПечати.Представление = НСтр("ru = 'Этикетки (формат А4)';
		|en = 'Labels A4'");	

	КонецЕсли;
	
	// -- rarus yukuzi 15.02.2021
	
КонецПроцедуры
// ++ rarus yukuzi 17.02.2021   // ФТ.СНБ.02. Задача_Штрихкодирование
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткиОтдельные") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткиОтдельные",
		НСтр("ru = 'Этикетки';
		|en = 'Labels'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(  ДанныеДляПечатиЭтикетки(МассивОбъектов), "ОбщиеМакеты.ПФ_MXL_Этикетки", Истина)
		,
		,
		"ОбщиеМакеты.ПФ_MXL_Этикетки"
		);
		
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткиА4") Тогда
		 ОтображатьКоличество=Ложь;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЭтикеткиА4",
		НСтр("ru = 'Этикетки';
		|en = 'Labels'"),
		рарусШтрихкодирование.СформироватьПечатнуюФормуЭтикетка(   ДанныеДляПечатиЭтикетки(МассивОбъектов), "Документ.впПриходТМЦ.ПФ_MXL_Этикетки")
		,
		,
		"Документ.впПриходТМЦ.ПФ_MXL_Этикетки"
		);
		
	КонецЕсли;		    	    	

КонецПроцедуры

Функция ДанныеДляПечатиЭтикетки(Ссылки) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.рспбКодMDG КАК рспбКодMDG,
	|	&ОсновноеСудно КАК Судно
	|ПОМЕСТИТЬ втНомен
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(рарусШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|	рарусШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втШК
	|ИЗ
	|	втНомен КАК втНомен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рарусШтрихкодыНоменклатуры КАК рарусШтрихкодыНоменклатуры
	|		ПО втНомен.Номенклатура = рарусШтрихкодыНоменклатуры.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	рарусШтрихкодыНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоКаталожныйНомер)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_КаталожныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоМодель)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_Модель,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоПроизводитель)
	|				ТОГДА НоменклатураДополнительныеРеквизиты.Значение
	|		КОНЕЦ) КАК ДопРекв_Производитель,
	|	НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры КАК ВидНоменклатуры
	|ПОМЕСТИТЬ втДопРеквизиты
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				втНомен.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втНомен КАК втНомен)
	|	И (НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоКаталожныйНомер)
	|			ИЛИ НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоМодель)
	|			ИЛИ НоменклатураДополнительныеРеквизиты.Свойство В (&СвойствоПроизводитель))
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураДополнительныеРеквизиты.Ссылка,
	|	НоменклатураДополнительныеРеквизиты.Ссылка.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНомен.Номенклатура КАК Номенклатура,
	|	втНомен.Судно КАК Судно,
	|	ПРЕДСТАВЛЕНИЕ(втНомен.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(втНомен.Судно) КАК СудноПредставление,
	|	ЕСТЬNULL(втШК.Штрихкод, """") КАК Штрихкод,
	|	1 КАК Количество,
	|	1 КАК КоличествоПечати,
	|	втДопРеквизиты.ДопРекв_КаталожныйНомер КАК НомерКаталога,
	|	втДопРеквизиты.ДопРекв_Модель КАК ОборудованиеПредставление,
	|	втДопРеквизиты.ДопРекв_Производитель КАК ПроизводительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(втДопРеквизиты.ВидНоменклатуры) КАК ТипОборудованияПредставление
	|ИЗ
	|	втНомен КАК втНомен
	|		ЛЕВОЕ СОЕДИНЕНИЕ втШК КАК втШК
	|		ПО втНомен.Номенклатура = втШК.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДопРеквизиты КАК втДопРеквизиты
	|		ПО втНомен.Номенклатура = втДопРеквизиты.Номенклатура");
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.УстановитьПараметр("ОсновноеСудно", vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно"));
	рарусШтрихкодирование.ПараметрыЗапросаПоДопреквизитам(Запрос);
	
	
	УстановитьПривилегированныйРежим(Истина);
	//Возврат Запрос.Выполнить().Выбрать();
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// -- rarus yukuzi 17.02.2021

#КонецОбласти

// -- rarus yukuzi 25.02.2021
